01. Import Data and Libraries

In [1]:
# import libraries 
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'/Users/kevinclancy/Desktop/Master Folder'

In [3]:
# import data
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

02. Data Wrangling

In [4]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
# rename columns
df_cust.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'last_name', 'STATE' : 'State', 'n_dependants' : 'Dependants'}, inplace = True)

In [8]:
df_cust.head()

,user_id,first_name,last_name,Gender,State,Age,date_joined,dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

03. Data Consistency Check

In [12]:
df_cust.describe()

                 Age     dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [14]:
# checking for mixed types

for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
        print(col)

first_name

In [15]:
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [16]:
# finding missing values
df_cust.isnull().sum()

user_id        0
first_name     0
last_name      0
Gender         0
State          0
Age            0
date_joined    0
dependants     0
fam_status     0
income         0
dtype: int64

In [17]:
# finding duplicates
df_cust_dups = df_cust[df_cust.duplicated()]

In [18]:
df_cust_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, Gender, State, Age, date_joined, dependants, fam_status, income]
Index: []

In [19]:
# import ords_prods data
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merged_agg.pkl'))

In [20]:
# check ords_prods shape
df_ords_prods.shape

(32404859, 23)

In [21]:
# check ords_prods data types
df_ords_prods.dtypes

order_id                   int64
user_id                    int64
order_number               int64
orders_day_of_week         int64
order_hour_of_day          int64
last_order               float64
first_order                 bool
product_id               float64
add_to_cart_order        float64
product_name              object
aisle_id                   int64
department_id              int64
prices                   float64
price_range_loc           object
busiest_day               object
busiest_days              object
busiest_period_of_day     object
max_order                  int64
loyalty_flag              object
average_spend            float64
spend_flag                object
frequent_customer        float64
frequency_flag            object
dtype: object

In [22]:
# check cust data types
df_cust.dtypes

user_id        object
first_name     object
last_name      object
Gender         object
State          object
Age             int64
date_joined    object
dependants      int64
fam_status     object
income          int64
dtype: object

In [23]:
df_cust['user_id'] =df_cust['user_id'].astype('int64')

In [24]:
df_cust['user_id'].dtype

dtype('int64')

04. Merge

In [26]:
df_merge = df_ords_prods.merge(df_cust, on = 'user_id', indicator = True)

In [27]:
# check output
df_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,last_order,first_order,product_id,add_to_cart_order,product_name,...,first_name,last_name,Gender,State,Age,date_joined,dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,True,196.0,1.0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,False,196.0,1.0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,False,196.0,1.0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,False,196.0,1.0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,False,196.0,1.0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

05. Export

In [28]:
df_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'instacart.pkl'))